In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_excel('bee_colony_loss.xlsx')

In [3]:
df.head()

,Year,Season,State,Total Annual Loss,Beekeepers,Beekeepers Exclusive to State,Colonies,Colonies Exclusive to State
0,2016/17,Annual,Massachusetts,0.159,87,0.943,27186,0.023
1,2016/17,Annual,Montana,0.171,21,0.524,35905,0.003
2,2016/17,Annual,Nevada,0.230,13,0.923,2512,0.052
3,2016/17,Annual,Maine,0.233,65,0.938,41102,0.014
4,2016/17,Annual,Wyoming,0.234,18,0.778,6521,0.014

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 8 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Year                            365 non-null    object
 1   Season                          365 non-null    object
 2    State                          365 non-null    object
 3    Total Annual Loss              349 non-null    float64
 4    Beekeepers                     365 non-null    int64
 5    Beekeepers Exclusive to State  365 non-null    float64
 6    Colonies                       365 non-null    int64
 7    Colonies Exclusive to State    365 non-null    float64
dtypes: float64(3), int64(2), object(3)
memory usage: 22.9+ KB

In [37]:
df.Year.unique()

array(['2016/17', '2015/16', '2014/15', '2013/14', '2012/13', '2011/12',
       '2010/11'], dtype=object)

In [38]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ','_')
df

,year,season,state,total_annual_loss,beekeepers,beekeepers_exclusive_to_state,colonies,colonies_exclusive_to_state
0,2016/17,Annual,Massachusetts,0.159,87,0.943,27186,0.023
1,2016/17,Annual,Montana,0.171,21,0.524,35905,0.003
2,2016/17,Annual,Nevada,0.230,13,0.923,2512,0.052
3,2016/17,Annual,Maine,0.233,65,0.938,41102,0.014
4,2016/17,Annual,Wyoming,0.234,18,0.778,6521,0.014
...,...,...,...,...,...,...,...,...
360,2010/11,Annual,Puerto Rico,NaN,1,1.000,12,1.000
361,2010/11,Annual,Alaska,NaN,2,0.500,6,1.000
362,2010/11,Annual,District of Columbia,NaN,1,1.000,4,1.000
363,2010/11,Annual,Wyoming,NaN,2,1.000,3883,1.000
364,2010/11,Annual,Nevada,NaN,3,0.333,3581,0.003

In [97]:
df.year = df.year.str.replace('2010/11','2011').str.replace('2011/2012','2012').str.replace('2012/13','2013').str.replace(
'2013/14','2014').str.replace('2014/15','2015').str.replace('2015/16','2016').str.replace('2016/17','2017')

In [99]:
df

,year,season,state,total_annual_loss,beekeepers,beekeepers_exclusive_to_state,colonies,colonies_exclusive_to_state
0,2017,Annual,Massachusetts,0.159,87,0.943,27186,0.023
1,2017,Annual,Montana,0.171,21,0.524,35905,0.003
2,2017,Annual,Nevada,0.230,13,0.923,2512,0.052
3,2017,Annual,Maine,0.233,65,0.938,41102,0.014
4,2017,Annual,Wyoming,0.234,18,0.778,6521,0.014
...,...,...,...,...,...,...,...,...
360,2011,Annual,Puerto Rico,NaN,1,1.000,12,1.000
361,2011,Annual,Alaska,NaN,2,0.500,6,1.000
362,2011,Annual,District of Columbia,NaN,1,1.000,4,1.000
363,2011,Annual,Wyoming,NaN,2,1.000,3883,1.000
364,2011,Annual,Nevada,NaN,3,0.333,3581,0.003

In [101]:
df.state = df.state.str.lower().str.replace(' ','_')

In [103]:
df = df.drop(columns='season')

In [104]:
df

,year,state,total_annual_loss,beekeepers,beekeepers_exclusive_to_state,colonies,colonies_exclusive_to_state
0,2017,massachusetts,0.159,87,0.943,27186,0.023
1,2017,montana,0.171,21,0.524,35905,0.003
2,2017,nevada,0.230,13,0.923,2512,0.052
3,2017,maine,0.233,65,0.938,41102,0.014
4,2017,wyoming,0.234,18,0.778,6521,0.014
...,...,...,...,...,...,...,...
360,2011,puerto_rico,NaN,1,1.000,12,1.000
361,2011,alaska,NaN,2,0.500,6,1.000
362,2011,district_of_columbia,NaN,1,1.000,4,1.000
363,2011,wyoming,NaN,2,1.000,3883,1.000
364,2011,nevada,NaN,3,0.333,3581,0.003

In [5]:
df2 = pd.read_csv('bee_colony_census_data_by_county.csv')

In [6]:
df2

,Year,Period,State,State ANSI,Ag District,Ag District Code,County,County ANSI,Value,CV (%)
0,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,AUTAUGA,1.0,119,27.7
1,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,DALLAS,47.0,65,27.7
2,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,ELMORE,51.0,190,27.7
3,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,GREENE,63.0,14,27.7
4,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,HALE,65.0,10,27.7
...,...,...,...,...,...,...,...,...,...,...
7825,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,GOSHEN,15.0,(D),NaN
7826,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,LARAMIE,21.0,(D),NaN
7827,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,PLATTE,31.0,(D),NaN
7828,2002,END OF DEC,WYOMING,56,WEST,30,LINCOLN,23.0,(D),NaN
7829,2002,END OF DEC,WYOMING,56,WEST,30,UINTA,41.0,(D),NaN

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7830 entries, 0 to 7829
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Year              7830 non-null   int64
 1   Period            7830 non-null   object
 2   State             7830 non-null   object
 3   State ANSI        7830 non-null   int64
 4   Ag District       7830 non-null   object
 5   Ag District Code  7830 non-null   int64
 6   County            7830 non-null   object
 7   County ANSI       7821 non-null   float64
 8   Value             7830 non-null   object
 9   CV (%)            2761 non-null   object
dtypes: float64(1), int64(3), object(6)
memory usage: 611.8+ KB

In [34]:
df2.columns = df2.columns.str.strip().str.lower().str.replace(' ', '_')

In [35]:
df2

,year,period,state,state_ansi,ag_district,ag_district_code,county,county_ansi,value,cv_(%)
0,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,AUTAUGA,1.0,119,27.7
1,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,DALLAS,47.0,65,27.7
2,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,ELMORE,51.0,190,27.7
3,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,GREENE,63.0,14,27.7
4,2012,END OF DEC,ALABAMA,1,BLACK BELT,40,HALE,65.0,10,27.7
...,...,...,...,...,...,...,...,...,...,...
7825,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,GOSHEN,15.0,(D),NaN
7826,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,LARAMIE,21.0,(D),NaN
7827,2002,END OF DEC,WYOMING,56,SOUTHEAST,50,PLATTE,31.0,(D),NaN
7828,2002,END OF DEC,WYOMING,56,WEST,30,LINCOLN,23.0,(D),NaN
7829,2002,END OF DEC,WYOMING,56,WEST,30,UINTA,41.0,(D),NaN

In [60]:
df2.period = df2.period.str.lower().str.replace(' ','_')

In [61]:
df2.state = df2.state.str.lower().str.replace(' ','_')

In [62]:
df2.ag_district = df2.ag_district.str.lower().str.replace(' ','_')

In [63]:
df2.county = df2.county.str.lower().str.replace(' ','_')

In [64]:
df2

,year,period,state,state_ansi,ag_district,ag_district_code,county,county_ansi,value,cv_(%)
0,2012,end_of_dec,alabama,1,black_belt,40,autauga,1.0,119,27.7
1,2012,end_of_dec,alabama,1,black_belt,40,dallas,47.0,65,27.7
2,2012,end_of_dec,alabama,1,black_belt,40,elmore,51.0,190,27.7
3,2012,end_of_dec,alabama,1,black_belt,40,greene,63.0,14,27.7
4,2012,end_of_dec,alabama,1,black_belt,40,hale,65.0,10,27.7
...,...,...,...,...,...,...,...,...,...,...
7825,2002,end_of_dec,wyoming,56,southeast,50,goshen,15.0,(D),NaN
7826,2002,end_of_dec,wyoming,56,southeast,50,laramie,21.0,(D),NaN
7827,2002,end_of_dec,wyoming,56,southeast,50,platte,31.0,(D),NaN
7828,2002,end_of_dec,wyoming,56,west,30,lincoln,23.0,(D),NaN
7829,2002,end_of_dec,wyoming,56,west,30,uinta,41.0,(D),NaN

In [8]:
df3 = pd.read_csv('bee_colony_survey_data_by_state.csv')

In [9]:
df3

,Year,Period,Week Ending,State,State ANSI,Watershed,Data Item,Value,CV (%)
0,2017,JAN THRU MAR,NaN,ALABAMA,1,NaN,ADDED & REPLACED,570,NaN
1,2017,JAN THRU MAR,NaN,ARIZONA,4,NaN,ADDED & REPLACED,"2,900",NaN
2,2017,JAN THRU MAR,NaN,ARKANSAS,5,NaN,ADDED & REPLACED,430,NaN
3,2017,JAN THRU MAR,NaN,CALIFORNIA,6,NaN,ADDED & REPLACED,"215,000",NaN
4,2017,JAN THRU MAR,NaN,COLORADO,8,NaN,ADDED & REPLACED,100,NaN
...,...,...,...,...,...,...,...,...,...
3391,1987,MARKETING YEAR,NaN,VIRGINIA,51,NaN,INVENTORY,"25,000",NaN
3392,1987,MARKETING YEAR,NaN,WASHINGTON,53,NaN,INVENTORY,"75,000",NaN
3393,1987,MARKETING YEAR,NaN,WEST VIRGINIA,54,NaN,INVENTORY,"21,000",NaN
3394,1987,MARKETING YEAR,NaN,WISCONSIN,55,NaN,INVENTORY,"92,000",NaN
3395,1987,MARKETING YEAR,NaN,WYOMING,56,NaN,INVENTORY,"39,000",NaN

In [10]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3396 entries, 0 to 3395
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         3396 non-null   int64
 1   Period       3396 non-null   object
 2   Week Ending  0 non-null      float64
 3   State        3396 non-null   object
 4   State ANSI   3396 non-null   int64
 5   Watershed    0 non-null      float64
 6   Data Item    3396 non-null   object
 7   Value        3396 non-null   object
 8   CV (%)       0 non-null      float64
dtypes: float64(3), int64(2), object(4)
memory usage: 238.9+ KB

In [16]:
df3 = df3.drop(columns=['Week Ending', 'Watershed', 'CV (%)'])

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3396 entries, 0 to 3395
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        3396 non-null   int64
 1   Period      3396 non-null   object
 2   State       3396 non-null   object
 3   State ANSI  3396 non-null   int64
 4   Data Item   3396 non-null   object
 5   Value       3396 non-null   object
dtypes: int64(2), object(4)
memory usage: 159.3+ KB

In [39]:
df3.columns = df3.columns.str.lower().str.replace(' ','_')
df3

,year,period,state,state_ansi,data_item,value
0,2017,JAN THRU MAR,ALABAMA,1,ADDED & REPLACED,570
1,2017,JAN THRU MAR,ARIZONA,4,ADDED & REPLACED,"2,900"
2,2017,JAN THRU MAR,ARKANSAS,5,ADDED & REPLACED,430
3,2017,JAN THRU MAR,CALIFORNIA,6,ADDED & REPLACED,"215,000"
4,2017,JAN THRU MAR,COLORADO,8,ADDED & REPLACED,100
...,...,...,...,...,...,...
3391,1987,MARKETING YEAR,VIRGINIA,51,INVENTORY,"25,000"
3392,1987,MARKETING YEAR,WASHINGTON,53,INVENTORY,"75,000"
3393,1987,MARKETING YEAR,WEST VIRGINIA,54,INVENTORY,"21,000"
3394,1987,MARKETING YEAR,WISCONSIN,55,INVENTORY,"92,000"
3395,1987,MARKETING YEAR,WYOMING,56,INVENTORY,"39,000"

In [43]:
df3.period = df3.period.str.lower().str.replace(' ','_')

In [44]:
df3.state = df3.state.str.lower().str.replace(' ','_')

In [45]:
df3.data_item = df3.data_item.str.lower().str.replace(' ','_').str.replace('&','')

In [149]:
df3.year.unique()

array([2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007,
       2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999, 1998, 1997, 1996,
       1995, 1994, 1993, 1992, 1991, 1990, 1989, 1988, 1987])

In [46]:
df3

,year,period,state,state_ansi,data_item,value
0,2017,jan_thru_mar,alabama,1,added__replaced,570
1,2017,jan_thru_mar,arizona,4,added__replaced,"2,900"
2,2017,jan_thru_mar,arkansas,5,added__replaced,430
3,2017,jan_thru_mar,california,6,added__replaced,"215,000"
4,2017,jan_thru_mar,colorado,8,added__replaced,100
...,...,...,...,...,...,...
3391,1987,marketing_year,virginia,51,inventory,"25,000"
3392,1987,marketing_year,washington,53,inventory,"75,000"
3393,1987,marketing_year,west_virginia,54,inventory,"21,000"
3394,1987,marketing_year,wisconsin,55,inventory,"92,000"
3395,1987,marketing_year,wyoming,56,inventory,"39,000"

In [113]:
df3.value = df3.value.str.replace(',','')

In [114]:
df3.value = df3.value.astype(int)

In [146]:
df3[df3.state == 'alabama'][df3.year == 2017][df3.period == 'jan_thru_mar']

/var/folders/5g/xrhpsnj56_v3scw9s4trbgxc0000gn/T/ipykernel_6101/3456484833.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3[df3.state == 'alabama'][df3.year == 2017][df3.period == 'jan_thru_mar']

,year,period,state,state_ansi,data_item,value
0,2017,jan_thru_mar,alabama,1,added__replaced,570
450,2017,jan_thru_mar,alabama,1,"inventory,_max",7000
900,2017,jan_thru_mar,alabama,1,"loss,_colony_collapse_disorder",250
1168,2017,jan_thru_mar,alabama,1,"loss,_deadout",1600

In [150]:
df3[df3.state == 'alabama'][df3.year == 2016][df3.period == 'jan_thru_mar']

/var/folders/5g/xrhpsnj56_v3scw9s4trbgxc0000gn/T/ipykernel_6101/2728789747.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3[df3.state == 'alabama'][df3.year == 2016][df3.period == 'jan_thru_mar']

,year,period,state,state_ansi,data_item,value
90,2016,jan_thru_mar,alabama,1,added__replaced,2100
540,2016,jan_thru_mar,alabama,1,"inventory,_max",7500
988,2016,jan_thru_mar,alabama,1,"loss,_colony_collapse_disorder",480
1258,2016,jan_thru_mar,alabama,1,"loss,_deadout",1700

In [151]:
df3[df3.state == 'alabama'][df3.year == 2017][df3.period == 'apr_thru_jun']

/var/folders/5g/xrhpsnj56_v3scw9s4trbgxc0000gn/T/ipykernel_6101/3383558582.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3[df3.state == 'alabama'][df3.year == 2017][df3.period == 'apr_thru_jun']

,year,period,state,state_ansi,data_item,value
45,2017,apr_thru_jun,alabama,1,added__replaced,1200
495,2017,apr_thru_jun,alabama,1,"inventory,_max",6500
945,2017,apr_thru_jun,alabama,1,"loss,_colony_collapse_disorder",20
1213,2017,apr_thru_jun,alabama,1,"loss,_deadout",440

In [11]:
df4 = pd.read_csv('bee_colony_survey_data_by_state_2018_2022.csv')

In [12]:
df4

,Program,Year,Period,Week Ending,Geo Level,State,State ANSI,Ag District,Ag District Code,County,...,Zip Code,Region,watershed_code,Watershed,Commodity,Data Item,Domain,Domain Category,Value,CV (%)
0,SURVEY,2022,APR THRU JUN,NaN,STATE,ALABAMA,1,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...",TOTAL,NOT SPECIFIED,"4,600",NaN
1,SURVEY,2022,APR THRU JUN,NaN,STATE,ALABAMA,1,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...",TOTAL,NOT SPECIFIED,"12,000",NaN
2,SURVEY,2022,APR THRU JUN,NaN,STATE,ALABAMA,1,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,270,NaN
3,SURVEY,2022,APR THRU JUN,NaN,STATE,ALABAMA,1,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...",TOTAL,NOT SPECIFIED,"1,300",NaN
4,SURVEY,2022,APR THRU JUN,NaN,STATE,ARIZONA,4,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...",TOTAL,NOT SPECIFIED,"17,500",NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3800,SURVEY,2018,OCT THRU DEC,NaN,STATE,WISCONSIN,55,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...",TOTAL,NOT SPECIFIED,"48,000",NaN
3801,SURVEY,2018,OCT THRU DEC,NaN,STATE,WISCONSIN,55,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...",TOTAL,NOT SPECIFIED,"8,500",NaN
3802,SURVEY,2018,OCT THRU DEC,NaN,STATE,WYOMING,56,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...",TOTAL,NOT SPECIFIED,220,NaN
3803,SURVEY,2018,OCT THRU DEC,NaN,STATE,WYOMING,56,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...",TOTAL,NOT SPECIFIED,"32,000",NaN
3804,SURVEY,2018,OCT THRU DEC,NaN,STATE,WYOMING,56,NaN,NaN,NaN,...,NaN,NaN,0,NaN,HONEY,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...",TOTAL,NOT SPECIFIED,"2,700",NaN

In [13]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3805 entries, 0 to 3804
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Program           3805 non-null   object
 1   Year              3805 non-null   int64
 2   Period            3805 non-null   object
 3   Week Ending       0 non-null      float64
 4   Geo Level         3805 non-null   object
 5   State             3805 non-null   object
 6   State ANSI        3805 non-null   int64
 7   Ag District       0 non-null      float64
 8   Ag District Code  0 non-null      float64
 9   County            0 non-null      float64
 10  County ANSI       0 non-null      float64
 11  Zip Code          0 non-null      float64
 12  Region            0 non-null      float64
 13  watershed_code    3805 non-null   int64
 14  Watershed         0 non-null      float64
 15  Commodity         3805 non-null   object
 16  Data Item         3805 non-null   object
 17  Domain            3805 non-null   object
 18  Domain Category   3805 non-null   object
 19  Value             3805 non-null   object
 20  CV (%)            0 non-null      float64
dtypes: float64(9), int64(3), object(9)
memory usage: 624.4+ KB

In [14]:
df4 = df4.drop(columns=['Week Ending', 'Ag District', 'Ag District Code', 'County', 'County ANSI', 'Zip Code',
                       'Region', 'Watershed'])

In [15]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3805 entries, 0 to 3804
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Program          3805 non-null   object
 1   Year             3805 non-null   int64
 2   Period           3805 non-null   object
 3   Geo Level        3805 non-null   object
 4   State            3805 non-null   object
 5   State ANSI       3805 non-null   int64
 6   watershed_code   3805 non-null   int64
 7   Commodity        3805 non-null   object
 8   Data Item        3805 non-null   object
 9   Domain           3805 non-null   object
 10  Domain Category  3805 non-null   object
 11  Value            3805 non-null   object
 12  CV (%)           0 non-null      float64
dtypes: float64(1), int64(3), object(9)
memory usage: 386.6+ KB

In [19]:
df4 = df4.drop(columns=['Program', 'Geo Level', 'watershed_code', 'Commodity', 'Domain', 'Domain Category', 'CV (%)'])

In [20]:
df4

,Year,Period,State,State ANSI,Data Item,Value
0,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...","4,600"
1,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","12,000"
2,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",270
3,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","1,300"
4,2022,APR THRU JUN,ARIZONA,4,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...","17,500"
...,...,...,...,...,...,...
3800,2018,OCT THRU DEC,WISCONSIN,55,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","48,000"
3801,2018,OCT THRU DEC,WISCONSIN,55,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","8,500"
3802,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...",220
3803,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","32,000"
3804,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","2,700"

In [47]:
df4.columns = df4.columns.str.lower().str.replace(' ','_')
df4

,year,period,state,state_ansi,data_item,value
0,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...","4,600"
1,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","12,000"
2,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",270
3,2022,APR THRU JUN,ALABAMA,1,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","1,300"
4,2022,APR THRU JUN,ARIZONA,4,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...","17,500"
...,...,...,...,...,...,...
3800,2018,OCT THRU DEC,WISCONSIN,55,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","48,000"
3801,2018,OCT THRU DEC,WISCONSIN,55,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","8,500"
3802,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - ADDED & REPLACED, MEASUR...",220
3803,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - INVENTORY, MAX, MEASURED...","32,000"
3804,2018,OCT THRU DEC,WYOMING,56,"HONEY, BEE COLONIES - LOSS, DEADOUT, MEASURED ...","2,700"

In [48]:
df4.period = df4.period.str.lower().str.replace(' ','_')

In [49]:
df4.state = df4.state.str.lower().str.replace(' ','_')

In [50]:
df4.data_item = df4.data_item.str.lower().str.replace(' ','_').str.replace(',','')

In [51]:
df4

,year,period,state,state_ansi,data_item,value
0,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_added_&_replaced_measured...,"4,600"
1,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_inventory_max_measured_in...,"12,000"
2,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_colony_collapse_diso...,270
3,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_deadout_measured_in_...,"1,300"
4,2022,apr_thru_jun,arizona,4,honey_bee_colonies_-_added_&_replaced_measured...,"17,500"
...,...,...,...,...,...,...
3800,2018,oct_thru_dec,wisconsin,55,honey_bee_colonies_-_inventory_max_measured_in...,"48,000"
3801,2018,oct_thru_dec,wisconsin,55,honey_bee_colonies_-_loss_deadout_measured_in_...,"8,500"
3802,2018,oct_thru_dec,wyoming,56,honey_bee_colonies_-_added_&_replaced_measured...,220
3803,2018,oct_thru_dec,wyoming,56,honey_bee_colonies_-_inventory_max_measured_in...,"32,000"
3804,2018,oct_thru_dec,wyoming,56,honey_bee_colonies_-_loss_deadout_measured_in_...,"2,700"

In [52]:
census = pd.concat([df4,df3])

In [53]:
census

,year,period,state,state_ansi,data_item,value
0,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_added_&_replaced_measured...,"4,600"
1,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_inventory_max_measured_in...,"12,000"
2,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_colony_collapse_diso...,270
3,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_deadout_measured_in_...,"1,300"
4,2022,apr_thru_jun,arizona,4,honey_bee_colonies_-_added_&_replaced_measured...,"17,500"
...,...,...,...,...,...,...
3391,1987,marketing_year,virginia,51,inventory,"25,000"
3392,1987,marketing_year,washington,53,inventory,"75,000"
3393,1987,marketing_year,west_virginia,54,inventory,"21,000"
3394,1987,marketing_year,wisconsin,55,inventory,"92,000"
3395,1987,marketing_year,wyoming,56,inventory,"39,000"

In [54]:
census.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7201 entries, 0 to 3395
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        7201 non-null   int64
 1   period      7201 non-null   object
 2   state       7201 non-null   object
 3   state_ansi  7201 non-null   int64
 4   data_item   7201 non-null   object
 5   value       7201 non-null   object
dtypes: int64(2), object(4)
memory usage: 393.8+ KB

In [55]:
census

,year,period,state,state_ansi,data_item,value
0,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_added_&_replaced_measured...,"4,600"
1,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_inventory_max_measured_in...,"12,000"
2,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_colony_collapse_diso...,270
3,2022,apr_thru_jun,alabama,1,honey_bee_colonies_-_loss_deadout_measured_in_...,"1,300"
4,2022,apr_thru_jun,arizona,4,honey_bee_colonies_-_added_&_replaced_measured...,"17,500"
...,...,...,...,...,...,...
3391,1987,marketing_year,virginia,51,inventory,"25,000"
3392,1987,marketing_year,washington,53,inventory,"75,000"
3393,1987,marketing_year,west_virginia,54,inventory,"21,000"
3394,1987,marketing_year,wisconsin,55,inventory,"92,000"
3395,1987,marketing_year,wyoming,56,inventory,"39,000"

In [56]:
census.year.value_counts()

2021    940
2020    940
2016    940
2018    760
2015    760
2019    715
2017    488
2022    450
1988     49
1989     49
1990     49
1987     49
1991     44
1992     44
1993     44
1994     44
1995     44
2003     44
2002     44
2001     44
1996     44
1998     43
1997     43
2000     43
1999     43
2004     41
2005     41
2006     41
2007     41
2008     41
2009     40
2011     40
2012     40
2014     40
2010     40
2013     39
Name: year, dtype: int64

In [57]:
census.period.value_counts()

marketing_year    1488
jan_thru_mar      1350
apr_thru_jun      1168
jul_thru_sep       990
oct_thru_dec       990
first_of_jan       360
first_of_apr       315
first_of_jul       270
first_of_oct       270
Name: period, dtype: int64

In [59]:
census[census.period == 'marketing_year']

,year,period,state,state_ansi,data_item,value
1170,2021,marketing_year,alabama,1,honey_bee_colonies_-_inventory_measured_in_col...,"8,000"
1171,2021,marketing_year,arizona,4,honey_bee_colonies_-_inventory_measured_in_col...,"26,000"
1172,2021,marketing_year,arkansas,5,honey_bee_colonies_-_inventory_measured_in_col...,"17,000"
1173,2021,marketing_year,california,6,honey_bee_colonies_-_inventory_measured_in_col...,"290,000"
1174,2021,marketing_year,colorado,8,honey_bee_colonies_-_inventory_measured_in_col...,"29,000"
...,...,...,...,...,...,...
3391,1987,marketing_year,virginia,51,inventory,"25,000"
3392,1987,marketing_year,washington,53,inventory,"75,000"
3393,1987,marketing_year,west_virginia,54,inventory,"21,000"
3394,1987,marketing_year,wisconsin,55,inventory,"92,000"
3395,1987,marketing_year,wyoming,56,inventory,"39,000"

In [100]:
df

,year,season,state,total_annual_loss,beekeepers,beekeepers_exclusive_to_state,colonies,colonies_exclusive_to_state
0,2017,Annual,Massachusetts,0.159,87,0.943,27186,0.023
1,2017,Annual,Montana,0.171,21,0.524,35905,0.003
2,2017,Annual,Nevada,0.230,13,0.923,2512,0.052
3,2017,Annual,Maine,0.233,65,0.938,41102,0.014
4,2017,Annual,Wyoming,0.234,18,0.778,6521,0.014
...,...,...,...,...,...,...,...,...
360,2011,Annual,Puerto Rico,NaN,1,1.000,12,1.000
361,2011,Annual,Alaska,NaN,2,0.500,6,1.000
362,2011,Annual,District of Columbia,NaN,1,1.000,4,1.000
363,2011,Annual,Wyoming,NaN,2,1.000,3883,1.000
364,2011,Annual,Nevada,NaN,3,0.333,3581,0.003

In [66]:
df2

,year,period,state,state_ansi,ag_district,ag_district_code,county,county_ansi,value,cv_(%)
0,2012,end_of_dec,alabama,1,black_belt,40,autauga,1.0,119,27.7
1,2012,end_of_dec,alabama,1,black_belt,40,dallas,47.0,65,27.7
2,2012,end_of_dec,alabama,1,black_belt,40,elmore,51.0,190,27.7
3,2012,end_of_dec,alabama,1,black_belt,40,greene,63.0,14,27.7
4,2012,end_of_dec,alabama,1,black_belt,40,hale,65.0,10,27.7
...,...,...,...,...,...,...,...,...,...,...
7825,2002,end_of_dec,wyoming,56,southeast,50,goshen,15.0,(D),NaN
7826,2002,end_of_dec,wyoming,56,southeast,50,laramie,21.0,(D),NaN
7827,2002,end_of_dec,wyoming,56,southeast,50,platte,31.0,(D),NaN
7828,2002,end_of_dec,wyoming,56,west,30,lincoln,23.0,(D),NaN
7829,2002,end_of_dec,wyoming,56,west,30,uinta,41.0,(D),NaN

In [67]:
df2.period.unique()

array(['end_of_dec'], dtype=object)

In [78]:
df2.value

0        119
1         65
2        190
3         14
4         10
        ...
7825     (D)
7826     (D)
7827     (D)
7828     (D)
7829     (D)
Name: value, Length: 7830, dtype: object

In [84]:
df2.value = df2.value.str.replace('(D)', '0').str.replace('(','').str.replace(')','').str.replace(',','')

/var/folders/5g/xrhpsnj56_v3scw9s4trbgxc0000gn/T/ipykernel_6101/466622883.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df2.value = df2.value.str.replace('(D)', '0').str.replace('(','').str.replace(')','').str.replace(',','')
/var/folders/5g/xrhpsnj56_v3scw9s4trbgxc0000gn/T/ipykernel_6101/466622883.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df2.value = df2.value.str.replace('(D)', '0').str.replace('(','').str.replace(')','').str.replace(',','')

In [87]:
df2.value = df2.value.astype(int)

In [92]:
df2.groupby(['state','year']).value.sum()

state      year
alabama    2002    17595
           2007     9072
           2012     8533
alaska     2002       54
           2007       99
                   ...
wisconsin  2007    29417
           2012    25196
wyoming    2002    14400
           2007    31926
           2012    35869
Name: value, Length: 150, dtype: int64

In [94]:
df2 = df2.drop(columns='period')

In [95]:
df2

,year,state,state_ansi,ag_district,ag_district_code,county,county_ansi,value,cv_(%)
0,2012,alabama,1,black_belt,40,autauga,1.0,119,27.7
1,2012,alabama,1,black_belt,40,dallas,47.0,65,27.7
2,2012,alabama,1,black_belt,40,elmore,51.0,190,27.7
3,2012,alabama,1,black_belt,40,greene,63.0,14,27.7
4,2012,alabama,1,black_belt,40,hale,65.0,10,27.7
...,...,...,...,...,...,...,...,...,...
7825,2002,wyoming,56,southeast,50,goshen,15.0,0,NaN
7826,2002,wyoming,56,southeast,50,laramie,21.0,0,NaN
7827,2002,wyoming,56,southeast,50,platte,31.0,0,NaN
7828,2002,wyoming,56,west,30,lincoln,23.0,0,NaN
7829,2002,wyoming,56,west,30,uinta,41.0,0,NaN